In [1]:
import todo
from importlib import reload
reload(todo);

ModuleNotFoundError: No module named 'todo'

In [6]:
td = todo.ToDoDB()

In [7]:
#td.run_query("SELECT * FROM sqlite_master;")

In [8]:
td.add_category('school')
td.add_category('work')

In [9]:
td.add_task('school', 'still studying for databases', '2024-03-29')
td.add_task('school', 'take a break', '2024-03-30')
td.add_task('work', 'teach databases', '2024-04-01')
td.add_task('work', 'give the class a quiz', '2024-04-01')

4

In [10]:
td.get_tasks()

   task_id category                          desc    date_due date_completed
0        1   school  still studying for databases  2024-03-29           None
1        2   school                  take a break  2024-03-30           None
2        3     work               teach databases  2024-04-01           None
3        4     work         give the class a quiz  2024-04-01           None

In [11]:
td.mark_complete(1)

In [12]:
td.get_tasks()

   task_id category                   desc    date_due date_completed
0        2   school           take a break  2024-03-30           None
1        3     work        teach databases  2024-04-01           None
2        4     work  give the class a quiz  2024-04-01           None

In [13]:
td.get_tasks(completed=True)

   task_id category                          desc    date_due date_completed
0        1   school  still studying for databases  2024-03-29     2024-03-29

In [14]:
td.get_tasks(category='work')

   task_id category                   desc    date_due date_completed
0        3     work        teach databases  2024-04-01           None
1        4     work  give the class a quiz  2024-04-01           None